/*
Navicat MySQL Data Transfer

Source Server         : MySQL
Source Server Version : 50505
Source Host           : localhost:3306
Source Database       : cinema

Target Server Type    : MYSQL
Target Server Version : 50505
File Encoding         : 65001

Date: 2017-07-17 11:14:29
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `film`
-- ----------------------------
DROP TABLE IF EXISTS `film`;
CREATE TABLE `film` (
  `Id` int(11) NOT NULL AUTO_INCREMENT,
  `Name` varchar(255) NOT NULL COMMENT '电影名称',
  `Img` varchar(255) NOT NULL COMMENT '影片图片',
  `BriefIntroduction` varchar(1000) NOT NULL COMMENT '简介',
  `Director` varchar(255) NOT NULL COMMENT '导演',
  `ToStar` varchar(255) NOT NULL COMMENT '主要演员',
  `Score` varchar(255) NOT NULL COMMENT '评分',
  `Country` varchar(255) NOT NULL COMMENT '哪个国家拍摄的',
  `LongTime` varchar(255) NOT NULL COMMENT '片长，影片放映时间有多久',
  `ReleaseTime` varchar(255) NOT NULL COMMENT '上映时间',
  `State` int(11) NOT NULL DEFAULT '1' COMMENT '1：正在上映。2:即将上映。0：已下映。',
  PRIMARY KEY (`Id`)
) ENGINE=InnoDB AUTO_INCREMENT=23 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of film
-- ----------------------------
INSERT INTO `film` VALUES ('1', '神偷奶爸3', 'http:\\/\\/img5.mtime.cn\\/mt\\/2017\\/05\\/25\\/093450.93995760.jpg', '《神偷奶爸3》将延续前两部的温馨、搞笑风格，聚焦格鲁和露西的婚后生活，继续讲述格鲁和三个女儿的爆笑故事。“恶棍”奶爸格鲁将会如何对付大反派巴萨扎·布莱德，调皮可爱的小黄人们又会如何耍贱卖萌，无疑让全球观众万分期待。该片配音也最大程度沿用前作阵容，史蒂夫·卡瑞尔继续为男主角格鲁配音，皮埃尔·柯芬也将继续为经典角色小黄人配音，而新角色巴萨扎·布莱德则由《南方公园》主创元老崔·帕克为其配音。', '皮艾尔·柯芬,凯尔·巴尔达', '史蒂夫·卡瑞尔,克里斯汀·韦格,崔·帕克,张伟,妮芙·沙瑞尔,米兰达·卡斯格拉夫,达娜·盖伊,皮艾尔·柯芬,朱丽·安德鲁斯,史蒂夫·库根,珍妮·斯蕾特,安迪·尼曼,迈克尔·贝亚蒂,布莱恩T·德莱尼,Adrian Ciscato', '8.8分', '美国', '90分钟', ' 2017-07-07', '1');
INSERT INTO `film` VALUES ('2', '记忆大师', 'http:\\/\\/img5.mtime.cn\\/mt\\/2017\\/04\\/13\\/104224.22044736.jpg', '故事发生在2025年，因为和妻子张代晨（徐静蕾 饰）婚姻破裂，男主角江丰（黄渤 饰）走进记忆大师医疗中心接受手术，却不料手术失误记忆被错误重载，他莫名其妙变成了“杀人凶手”。警官沈汉强（段奕宏 饰）的穷追不舍让他逐渐发现，自己脑内的错误记忆不仅是破案的关键，更是救赎自己的唯一希望。与此同时，妻子身边出现的女人陈姗姗（杨子姗 饰）、记忆中浮现出的神秘女子（许玮甯 饰），似乎也和真相有着千丝万缕的联系，一场记忆烧脑战也随之开始。', '陈正道', '黄渤,徐静蕾,段奕宏,杨子姗,许玮甯,梁杰理,王振,焦刚', '8.5分', '中国大陆', '119分钟', '2017-04-28', '1');
INSERT INTO `film` VALUES ('3', '撞邪31号', 'http:\\/\\/img5.mtime.cn\\/mt\\/2017\\/06\\/13\\/162107.56784902.jpg', '《撞邪31号》讲述的是一段因设计师宇浩与热恋女友安妮因工作入住31号别墅而引发一系列离奇事件的故事。别墅半夜经常有鬼影出现，被居民定义鬼宅。鬼影在炎炎夏日蓄谋攻击女友安妮，深夜中几度与安妮交手。事情恶化，宇浩被不明魂魄拖下深水险些丧命，后被托梦物品被盗，宇浩被诬陷，宇浩决定要找出鬼怪，诡异事件接踵而至……', '李克龙', '来喜,廖蔚蔚,李子雄,韩志,盛石头,徐海鹏,范明辉,刘宝,黄金梅,刘思杰,刘宝旭', '6.6分', '中国大陆', '90分钟', '2017-06-30', '1');
INSERT INTO `film` VALUES ('4', '重返·狼群', 'http:\\/\\/img5.mtime.cn\\/mt\\/2017\\/06\\/08\\/104709.39137079.jpg', '美女画家李微漪在一次草原采风中意外收养了狼王遗孤，为其取名格林，并带回成都喂养。但繁华的都市无法容纳一匹野性的草原狼，李微漪带着格林重返草原，一路追寻狼群的踪迹，历经严寒酷雪，终于目送它成功地重返狼群。', '亦风', '亦风,李微漪', '8.9分', '中国大陆', '98分钟', '2017-06-16', '1');
INSERT INTO `film` VALUES ('5', '三只小猪2', 'http:\\/\\/img5.mtime.cn\\/mt\\/2017\\/04\\/26\\/141632.55475528.jpg', '三只小猪因顽皮遇险，被功夫侠阿潘和阿达所救。阿潘、阿达是三只小猪共同的偶像，因此小猪们死缠烂打地拜师学艺跟着学功夫。可是，曾经的偶像似乎并不与传说中一样的厉害，甚至被老对手功夫怪狼追着四处狼狈逃窜。这让三只小猪非常失望。小猪们于是决定靠自己的力量打败怪狼，然而他们的冲动莽撞却再次引来了更大的灾难。而且，小猪们并不知道，功夫潘达其实一直守护着一个能改变世界的武林秘宝。功夫怪狼以三只小猪为要挟，逼得阿潘与阿达再次出手。能力与责任、正义与力量，一场森林王国的巅峰对决就此展开！', '刘炜', '王晓彤,李晔,洪海天,严丽祯,骆妍倩,刘北辰,贾邱,胡谦', '7.3分', '中国大陆', '70分钟', '2017-05-27', '1');
INSERT INTO `film` VALUES ('6', '大护法', 'http:\\/\\/img5.mtime.cn\\/mt\\/2017\\/07\\/12\\/112412.64304863.jpg', '奕卫国的太子因为厌恶宫廷的禁锢,独自离宫出 走。红袍护法紧跟其后,追随太子的踪迹来到一个与 世隔绝的花生镇。花生镇居住着各种奇异的生灵,镇 上的居民们个个神情呆滞,并深陷死亡恐惧中,一个 巨大的黑花生像幽灵一般漂浮在天空。当护法闯入花生镇时,不段遭遇当地刑法者的攻击。大护法无暇顾及这个世界的种种怪异现象,孤身 其中苦苦寻找太子的踪迹。终于在深山中找到了太子, 以为可以和太子一同安全回宫,却又陷入了一场更大的危机中......', '不思凡', '小连杀,图特哈蒙,金士杰,幽舞越山,李佳怡,李兰陵,郭盛,叶知秋,佟心竹,邢凯新,藤新,郝翔海,北斗企鹅', '7.7分', '中国大陆', '93分钟', '2017-07-13', '1');
INSERT INTO `film` VALUES ('7', '和田玉传奇', 'http:\\/\\/img5.mtime.cn\\/mt\\/2017\\/04\\/07\\/141247.23796888.jpg', '讲述了玉石收藏家艾合买提将流落在外的和田古玉完璧归赵的故事。一个新疆旅行团中的神秘帅哥汤姆李（唐文龙 饰）、高调女游客萧楠（傅莹莹 饰）、盗贼夫妇（王一楠、任正彬 饰）各怀鬼胎，他们的目标都是要抢夺玉石收藏家艾合买提在拍卖会得到的和田古玉，三伙人马用尽浑身解数，最终谁将抢得和田古玉？宝玉的去向又是何方……', '郭松', '唐文龙,王一楠,任正彬,傅斌,傅莹莹', '7.9分', '中国大陆', '94分钟', '2017-04-25', '1');
INSERT INTO `film` VALUES ('8', '忠爱无言', 'http:\\/\\/img5.mtime.cn\\/mt\\/2017\\/05\\/18\\/154316.75973774.jpg', '主要讲述一条小狗因为意外，结识一位性格倔强孤僻的残疾老人，由格格不入的相互争斗，到同病相怜的息息相处，直到最后相依为命。狗狗为老人拉车赶集修理小电器，相濡以沫，朝夕相处十余载。这是一位老人和一条狗令人悲恸的真情！', '谈宜之', '高强,于月仙,李玉峰,王玉宁,储毅', '8分', '中国大陆', '97分钟', '2017-06-09', '1');
INSERT INTO `film` VALUES ('9', '秘果', 'http:\\/\\/img5.mtime.cn\\/mt\\/2017\\/07\\/10\\/101901.50623121.jpg', '十七岁的男生段柏文（陈飞宇 饰）自幼丧母，与继母矛盾剧烈，敏感坎坷的少年爱上了特立独行的老师“小耳朵”李珥（米咪 饰），这也成为了他心里的秘密。元气少女于池子（欧阳娜娜 饰）心里也有一个秘密，她暗恋着自己的青梅竹马段柏文。可是有一天她发现自己的闺蜜、个性校花斯嘉丽（邹元清 饰）秘密经营着与段柏文的特殊关系，愤怒的她开始了自己的复仇计划……', '连奕琦', '陈飞宇,欧阳娜娜,邹元清,张诚航', '7.6分', '中国大陆', '99分钟', '2017-07-07', '1');
INSERT INTO `film` VALUES ('10', '与君相恋100次', 'http:\\/\\/img5.mtime.cn\\/mt\\/2017\\/06\\/13\\/102515.11465708.jpg', '影片讲述了阿陆为拯救遭遇意外的恋人葵海，多次穿越时空回到过去，以求阻止悲剧发生的唯美爱情故事。从Live演唱回家的大学生日向葵海（miwa 饰）在生日当天的晚上遭遇交通事故，醒来后葵海却发现自己在教室里，并且时间回到了事故的一周前，葵海青梅竹马的朋友长谷川陆（坂口健太郎 饰）告诉她，自己可以回到过去，让时间倒流。为改写葵海的命运，阿陆回到了一年前，两人终于成为了让朋友羡慕的恋人，而阿陆却隐瞒了自己回到过去的秘密，随着发生事故的日期渐渐临近，阿陆下定决心誓要扭转葵海的命运……', '月川翔', 'miwa,坂口健太郎,龙星凉,真野惠里菜,泉泽祐希,太田莉菜,堀内敬子,田边诚一', '7.8分', '日本', '117分钟', '2017-07-06', '1');
INSERT INTO `film` VALUES ('11', '绝世高手', 'http:\\/\\/img5.mtime.cn\\/mt\\/2017\\/06\\/14\\/120719.72285089.jpg', '混混卢小鱼，在一次执行破坏任务的过程中遇到了大大咧咧的吃货小曼，小鱼顺势利用小曼去完成他的「大任务」，由此卷入美食江湖，见识了光怪陆离的烹饪绝技，也被各位厨师高手的真诚感化，走向正义之路。', '卢正雨', '郭采洁,卢正雨,范伟,蔡国庆,陈冲,孔连顺,黄龄,杨迪,柯达,仓田保昭,艾伦,赵英俊,魏翔,汪聪,许文姗', '7.5分', '中国大陆', '116分钟', '2017-07-07', '1');
INSERT INTO `film` VALUES ('12', '原谅他77次', 'http:\\/\\/img5.mtime.cn\\/mt\\/2017\\/06\\/20\\/141106.47547702.jpg', 'Eva（蔡卓妍 饰） 与Adam（周柏豪 饰）拍拖十年多，却因一件小事突然分手。莫名被分手的Adam酒后与学生Mandy（ 卫诗雅 饰）发生了关系。可随后Mandy却在Adam家中意外发现了一本Eva所写的77次心碎记录，记事簿里Eva一次次的被伤害纪录历历在目⋯Adam愧疚不已，鼓起勇气在众目睽睽之前向Eva道歉。岂料，Eva却在Adam家中发现了Mandy的物品⋯到底她可否原谅Adam第78次呢？', '邱礼涛', '蔡卓妍,周柏豪,钟欣潼,卫诗雅,卢巧音,郑希怡,雷琛瑜,C君,陆永,林盛斌,小肥,惠英红,郑丹瑞,李蕙敏,秦辰', '7.6分', '中国香港', '96分钟', '2017-06-23', '1');
INSERT INTO `film` VALUES ('13', '青春逗', 'http:\\/\\/img5.mtime.cn\\/mt\\/2017\\/06\\/13\\/143643.16669570.jpg', '富二代林汉杰，学霸程铭，学渣郝大雨并称东山大学“三贱客”。毕业前的最后一个光棍节，在林汉杰的鼓噪下，三人策划了一次疯狂的“脱光行动”。他们假扮成功学长返校讲座，主题是“事业与爱情”。正当学弟学妹们被林汉杰的奇谈怪论煽动得跃跃欲试时，宿敌柯芸出现搅局并当场揭穿。于是，开始了二人自进校以来，全面升的“逗”智“斗”勇。他们从“敌情”斗成“友情”，并最终由“友情”逗至“爱情”。 在走向社会的过程中，每遇奇葩事件，他们整蛊应对“仗贱”前行…… 临近毕业，所有人都忙着找工作，只有林汉杰整天无所事事。家庭的破产令林汉杰命运跌入谷底。苦于无奈，他找了一份群众演员的工作。面对和柯芸在战“逗”的过程中升华的爱情，他选择了逃避…… 一年后，当他们偶遇时，竟然是在林汉杰扮演小偷，被过往群众误会打得鼻青脸肿的拍摄现场。得知消息的程铭辞去了工作，找到林汉杰并说服他和自己共同创业。“冤家对头”柯芸对落难的林汉杰不离不弃，二人终于在精心设计的求婚仪式下修成正果。一路走来，他们经受了爱情和友情的考验，渐渐的成长，并开始学会面对……他们在坚持中赢得机会，在失落后找回自我！', '郑仕明', '姜潮,张嘉倪,金恩圣,马春瑞,闫安,于文文,李功常,罗海琼,王景春,李彬,欧丽雅,何涌生,秦朗', '7.2分', '中国大陆', '97分钟', '2017-07-07', '1');
INSERT INTO `film` VALUES ('14', '闪光少女', 'http:\\/\\/img5.mtime.cn\\/mt\\/2017\\/07\\/06\\/105629.72336348.jpg', '主要讲述了学扬琴的高二女生陈惊，为了向暗恋的师哥证明自己，组起了二次元民乐小乐队，不仅打破了西洋乐学生对民乐的偏见，还和朋友们一起登上了国家大剧院的舞台，找到了自己价值的故事。', '王冉', '徐璐,彭昱畅,刘泳希,骆明劼,韩忠羽,鲁照华,李诺,陈雨锶,乐思宏,陈奕迅,闫妮,耿乐', '8.9分', '中国大陆', '103分钟', '2017-07-20', '1');
INSERT INTO `film` VALUES ('15', '青禾男高', 'http:\\/\\/img5.mtime.cn\\/mt\\/2017\\/05\\/25\\/171344.67642434.jpg', '在一所名为青禾男高的学校里，荆浩和阿屁、谭家木、幺鸡、二柄四位少年在特别的校园环境中结成了生死与共的挚友兄弟，并成为这所男高里唯一对抗校园霸凌的团体，压制了柴田等人横行霸道的校园恶行。在特殊的时代氛围里，两方势力保持着微妙的平衡，直到女教师柳禾的出现，平衡被打破，这所男高里的少年们将何去何从，就此展开的激战如箭在弦。', '蒋卓原', '景甜,欧豪,黑木明纱,林遣都,尹昉,周游,丁冠森,张宁江,夏恩,姜宗远,中岛广稀', '7.8分', '中国大陆', '98分钟', '2017-07-12', '1');
INSERT INTO `film` VALUES ('16', '反转人生', 'http:\\/\\/img5.mtime.cn\\/mt\\/2017\\/06\\/14\\/102756.92094848.jpg', '保险推销员马奋斗空有满腔抱负却郁郁不得志，在和多年在一起的女朋友姗姗分手后，他的人生彻底跌入谷底。然而，一个自称是神仙的上官芙蓉的出现却颠覆了他的生活轨迹，进而引出了一系列爆笑离奇的反转故事。', '伍仕贤', '夏雨,闫妮,潘斌龙,宋茜,吴大维,郭凯敏,李勤勤,吴彦祖,宁静,包贝尔,李静,雷佳音,田雷,英达,隋凯', '8.2分', '中国大陆', '110分钟', '2017-06-29', '1');
INSERT INTO `film` VALUES ('17', '明月几时有', 'http:\\/\\/img5.mtime.cn\\/mt\\/2017\\/06\\/15\\/123140.23327224.jpg', '影片讲述了以香港传奇女性“方姑”为代表的仁人志士，在1940年代风云变幻的香港展开生死救援的故事。片中，历史上著名的“东江纵队生死大营救”事件是重要的叙事线索——彼时，广东人民抗日游击队根据中共中央指示，克服重重困难，将何香凝、柳亚子、茅盾、邹韬奋等数百文化名人及爱国民主人士成功营救出战火纷飞的香港。', '许鞍华', '周迅,彭于晏,霍建华,郭涛,黄志忠,蒋雯丽,梁家辉,王菀之,吕良伟,叶德娴,永濑正敏,春夏,森田凉花,鲍起静,李灿森', '8分', '中国大陆', '131分钟', '2017-07-01', '1');
INSERT INTO `film` VALUES ('18', '雄狮', 'http:\\/\\/img5.mtime.cn\\/mt\\/2017\\/06\\/21\\/171258.38600757.jpg', '印度村庄Shivgad的检察官Bajirao Singham一直以一己之力对抗着当地的黑恶势力，美丽的Kavya也因为他的正义而对他心生好感。然而当Bajirao被提拔来到Goa地区，他发现当地的掌控者Jaykant其实是无数犯罪的幕后黑手，在被Jaykant严密控制着的Goa地区，嫉恶如仇的Bajirao正面临着一生中最大的挑战。', 'Rohit Shetty', '阿贾耶·德乌干,卡佳·阿加瓦尔,Prakash Raj,Sonali Kulkarni,Sachin Khedekar,Suchitra Bandekar,Ravindra Berde,Suhasini Deshpande,Agasthya Dhanorkar,Anant Jog,Kishore Nandlaskar,Vijay Patkar,Ashok Samarth,Ashok Saraf,Jayant Sawarkar', '6.5分', '印度', '143分钟', '2020-12-31', '1');
INSERT INTO `film` VALUES ('19', '京城81号2', 'http:\\/\\/img5.mtime.cn\\/mt\\/2017\\/06\\/27\\/113720.70077857.jpg', '本片取材自被誉为“东方四大鬼宅之首”——京城81号古宅的诡异故事： 民国初年，位于京城八大胡同内的青楼歌舞升平，尤以头牌陆蝶玉艳惊四座，引得万人空巷。但她早已倾心京城大户霍家三少爷，几经波折，陆蝶玉嫁入霍家。怎料新婚之夜新郎却变成刚刚过世的霍家二少爷,冥婚后不久陆蝶玉离奇怀孕，一时鬼胎传言四起，家族上下不安，不久便举家惨遭灭门，留下阴宅保留至今。 一百年后，81号古宅后人许若卿重返故居，百年前发生在这里的惨案历历在目。同时，她的出现也意外唤起了古宅内尘封已久的孤魂孽怨。', '叶伟民', '吴镇宇,林心如,杨祐宁,秦海璐,莫小棋,李菁,金燕玲,夏文汐,袁祥仁,李晓川,韩志,茹天,顾语涵,王嫒,潘子逸', '7分', '中国', '90分钟', '2014-07-18', '1');
INSERT INTO `film` VALUES ('20', '变形金刚5：最后的骑士', 'http:\\/\\/img5.mtime.cn\\/mt\\/2017\\/06\\/15\\/110834.10533198.jpg', '人类和变形金刚开战，擎天柱失踪，拯救未来的关键就埋藏在历史的秘密之中，那是地球上变形金刚的历史。拯救世界的责任落在一支非同寻常的队伍身上：凯德·伊格尔（马克·沃尔伯格饰）、大黄蜂、一位英国爵士（安东尼·霍普金斯饰）还有一位牛津大学教授（劳拉·哈德克饰）。每个人一生中都会遇到这样一个时刻，它召唤着我们去改变世界。在《变形金刚5：最后的骑士》中，一直被追捕的人将成为英雄，英雄会变成反派。我们和他们的世界，只能存活一个。', '迈克尔·贝', '马克·沃尔伯格,伊莎贝拉·莫奈,劳拉·哈德克,乔什·杜哈明,安东尼·霍普金斯,彼特·库伦,约翰·古德曼,渡边谦,嘉玛·陈,李冰冰,斯坦利·图齐,约翰·迪·玛吉欧,约翰·特托罗,利亚姆·加里根,桑地亚哥·卡布瑞拉', '7.4分', '美国', '150分钟', '2017-06-23', '1');
INSERT INTO `film` VALUES ('21', '仙球大战', 'http:\\/\\/img5.mtime.cn\\/mt\\/2017\\/06\\/07\\/153502.66745915.jpg', '讲述宋朝年间一众爱国人士用踢球对抗奸臣外敌的故事，皇亲贵胄、土匪山贼、武林高手纷纷出镜，组成史上最多元球队，怀抱国仇家恨完成了中国历史上第一次国际球赛。', '刘镇伟', '何炅,钟欣潼,蔡卓妍,邓丽欣,容祖儿,马丽,杜海涛,李维嘉,吴昕,李菁,林子聪,元奎,袁祥仁,赵志凌', '7.4分', '中国大陆', '84分钟', '2017-06-30', '1');
INSERT INTO `film` VALUES ('22', '我的播音系女友', 'http:\\/\\/img31.mtime.cn\\/mt\\/2014\\/04\\/29\\/095552.43207749.jpg', '戏剧学院校园里，不乏俊男美女、各个神采奕奕，到处充斥着那股子文艺范儿。播音主持系的女生长得都跟祖国的花儿似的，一个比一个招人眼球，但只有那些亲近她们的人才知道，她们是带刺的玫瑰，有一张刀子般的嘴，一般人都不敢惹。张了了（戚薇&nbsp;饰），这一届播音系系花，漂亮是必然，个性十足的她，更是校园里许多男生的梦中情人。戏文系的白亮（汪东城&nbsp;饰），高个儿，俊朗的外表下有一颗赤子之心，又带着点儿痞，他看上了张了了的霸气，张了了的才气，以及张了了坚强外表下那一颗需要人保护着的柔软的心，他觉得他能懂她。&nbsp;　　这一对欢喜冤家，在吵吵嚷嚷之间，感情日渐加深，一番追求之后，在校园的那片桃树林里，纤瘦身子倚树靠着的张了了，接受了白亮的一个吻，他们相爱了。', '程中豪,王凯', '汪东城,戚薇', '6.6分', '中国', '90分钟', '2014-05-20', '1');

-- ----------------------------
-- Table structure for `room`
-- ----------------------------
DROP TABLE IF EXISTS `room`;
CREATE TABLE `room` (
  `Id` int(11) NOT NULL AUTO_INCREMENT,
  `RoomNumber` varchar(255) NOT NULL COMMENT '房间号',
  PRIMARY KEY (`Id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of room
-- ----------------------------

-- ----------------------------
-- Table structure for `roomseat`
-- ----------------------------
DROP TABLE IF EXISTS `roomseat`;
CREATE TABLE `roomseat` (
  `Id` int(11) NOT NULL AUTO_INCREMENT,
  `Row` int(11) NOT NULL COMMENT '行',
  `Col` int(11) NOT NULL COMMENT '列',
  `RoomId` int(11) NOT NULL COMMENT '对应的房间号',
  `State` int(11) NOT NULL DEFAULT '1' COMMENT '1：空着的。0：已被预订',
  `SeatNumber` int(11) NOT NULL COMMENT '座位编号',
  PRIMARY KEY (`Id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of roomseat
-- ----------------------------
